Revit 2020 API
LabelUtils.GetLabelFor Method (DisplayUnitType)
 Gets the user-visible name for a DisplayUnitType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2011
Syntax
C#
public static string GetLabelFor(
	DisplayUnitType displayUnitType
)
Visual Basic
Public Shared Function GetLabelFor ( _
	displayUnitType As DisplayUnitType _
) As String
Visual C++
public:
static String^ GetLabelFor(
	DisplayUnitType displayUnitType
)
Parameters
displayUnitType
Type: Autodesk.Revit.DB.DisplayUnitType
 The DisplayUnitType to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Cannot find DisplayUnitTypeInfo for the DisplayUnitType.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace